src/CF/InformationRegisters/КШДЯдроКэшНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КШДЯдроКэшНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КШДЯдроТипыХранимыхЗначений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Число</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Булево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контур</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КШДЯдроКлючиКэшаНастроек</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/Enums/КШДЯдроТипыХранимыхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КШДЯдроТипыХранимыхЗначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/CommonModules/КШДЯдроВызовСервераПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СервисКэшированияНастроек

// Получает ранее записанное значение из кэша или неопределено если значение в кэше не обнаружено
//
// Параметры:
//  Контур	 - Строка - Идентификатор контура
//  Ключ	 - Перечисление.КШДЯдроКлючиКэшаНастроек - Ключ записываемых настроек
// 
// Возвращаемое значение:
//  Произвольный - Значение, сохраненное в кеше
//
Функция ЗначениеИзКэша(Контур, Ключ) Экспорт
	СтруктураОтбора = Новый Структура("Контур, Ключ", Контур, Ключ);
	КэшированныеДанные = РегистрыСведений.КШДЯдроКэшНастроек.Получить(СтруктураОтбора);
	
	Если Не ЗначениеЗаполнено(КэшированныеДанные.ТипЗначения) Тогда
		//Данных к кеше нет
		Возврат Неопределено;
	КонецЕсли;
	
	Если КэшированныеДанные.ТипЗначения = Перечисления.КШДЯдроТипыХранимыхЗначений.Число Тогда
		Возврат КэшированныеДанные.Число;
	ИначеЕсли КэшированныеДанные.ТипЗначения = Перечисления.КШДЯдроТипыХранимыхЗначений.Строка Тогда
		Возврат КэшированныеДанные.Строка;
	ИначеЕсли КэшированныеДанные.ТипЗначения = Перечисления.КШДЯдроТипыХранимыхЗначений.Дата Тогда
		Возврат КэшированныеДанные.Дата;
	ИначеЕсли КэшированныеДанные.ТипЗначения = Перечисления.КШДЯдроТипыХранимыхЗначений.Булево Тогда
		Возврат КэшированныеДанные.Булево;
	Иначе
		Возврат КэшированныеДанные.Прочее.Получить();
	КонецЕсли;
КонецФункции
	
#КонецОбласти

#КонецОбласти
